<script>
export default {
  name: 'privacy-policy',
  head: {
    title: 'Информация о доставке и оплате | Политика конфиденциальности'
  }
}
</script>

<template>
  <main class="section-substrate">
    <div class="container">
      <div class="title">
        Политика конфиденциальности
      </div>
      <div class="substrate text-style">
        <p>Настоящая Политика конфиденциальности персональной информации (далее — Политика) действует в отношении всей информации, которую ИП Саликов Евгений Александрович (ИНН: 636501888753, ОГРН 321237500115405, адрес места нахождения Краснодарский край, г. Анапа, ул. Омелькова, д. 21) и/или его аффилированные лица, могут получить о пользователе во время использования им сайта  <a href="https://skorohot.ru" target="_blank">skorohot.ru</a>.</p>
        <p>Использование сайта <a href="https://skorohot.ru" target="_blank">skorohot.ru</a> означает безоговорочное согласие пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации; в случае несогласия с этими условиями пользователь должен воздержаться от использования данного ресурса.</p>
        <ul>
          <li><span class="text-style__list-number">1.1</span>Персональная информация пользователей, которую получает и обрабатывает сайт <a href="https://skorohot.ru" target="_blank">skorohot.ru</a> в рамках настоящей Политики под «персональной информацией пользователя» понимаются:</li>
          <li><span class="text-style__list-number">1.1.1</span>Персональная информация, которую пользователь предоставляет о себе самостоятельно при оставлении заявки, совершении покупки, регистрации (создании учётной записи) или в ином процессе использования сайта.</li>
          <li><span class="text-style__list-number">1.1.2</span>Данные, которые автоматически передаются сайтом <a href="https://skorohot.ru" target="_blank">skorohot.ru</a> в процессе его использования с помощью установленного на устройстве пользователя программного обеспечения, в том числе IP-адрес, информация из cookie, информация о браузере пользователя (или иной программе, с помощью которой осуществляется доступ к сайту), время доступа, адрес запрашиваемой страницы.</li>
          <li>
            <span class="text-style__list-number">1.1.3</span>Данные, которые предоставляются сайту, в целях осуществления оказания услуг и/или продаже товара и/или предоставления иных ценностей для посетителей сайта, в соответствии с деятельностью настоящего ресурса:
            <ul>
              <li>имя</li>
              <li>номер телефона</li>
            </ul>
          </li>
          <li><span class="text-style__list-number">1.2</span>Настоящая Политика применима только к сайту <a href="https://skorohot.ru" target="_blank">skorohot.ru</a> и не контролирует и не несет ответственность за сайты третьих лиц, на которые пользователь может перейти по ссылкам, доступным на сайте http://skorohot.ru. На таких сайтах у пользователя может собираться или запрашиваться иная персональная информация, а также могут совершаться иные действия.</li>
          <li><span class="text-style__list-number">1.3</span>Сайт в общем случае не проверяет достоверность персональной информации, предоставляемой пользователями, и не осуществляет контроль за их дееспособностью. Однако сайт <a href="https://skorohot.ru" target="_blank">skorohot.ru</a>  исходит из того, что пользователь предоставляет достоверную и достаточную персональную информацию по вопросам, предлагаемым в формах настоящего ресурса, и поддерживает эту информацию в актуальном состоянии.</li>
          <li class="text-style__list-title">
            <span class="text-style__list-number">2</span>
            <strong>Цели сбора и обработки персональной информации пользователей</strong>
          </li>
          <li><span class="text-style__list-number">2.1</span>Сайт собирает и хранит только те персональные данные, которые необходимы для оказания услуг и/или продаже товара и/или предоставления иных ценностей для посетителей сайта <a href="https://skorohot.ru" target="_blank">skorohot.ru</a></li>
          <li><span class="text-style__list-number">2.2</span>Персональную информацию пользователя можно использовать в следующих целях:</li>
          <li><span class="text-style__list-number">2.3</span>Идентификация стороны в рамках соглашений и договоров с сайтом</li>
          <li><span class="text-style__list-number">2.4</span>Предоставление пользователю персонализированных услуг и сервисов, товаров и иных ценностей</li>
          <li><span class="text-style__list-number">2.5</span>Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования сайта, оказания услуг, а также обработка запросов и заявок от пользователя</li>
          <li><span class="text-style__list-number">2.6</span>Улучшение качества сайта, удобства его использования, разработка новых товаров и услуг</li>
          <li><span class="text-style__list-number">2.7</span>Таргетирование рекламных материалов</li>
          <li><span class="text-style__list-number">2.8</span>Проведение статистических и иных исследований, на основе предоставленных данных</li>
          <li><span class="text-style__list-number">2.9</span>Передача данных третьим лицам, в целях осуществления деятельности ресурса (например, доставка товара курьером, транспортной компанией и иные)</li>
          <li><span class="text-style__list-number">2.10</span>Заключения, исполнения и прекращения гражданско-правовых договоров с физическими, юридическими лицами, индивидуальными предпринимателями и иными лицами, в случаях, предусмотренных действующим законодательством и/или Уставом предприятия</li>
          <li class="text-style__list-title">
            <span class="text-style__list-number">3</span>
            <strong>Условия обработки персональной информации пользователя и её передачи третьим лицам</strong>
          </li>
          <li><span class="text-style__list-number">3.1</span>Сайт https://skorohot.ru хранит персональную информацию пользователей в соответствии с внутренними регламентами конкретных сервисов.</li>
          <li><span class="text-style__list-number">3.2</span>В отношении персональной информации пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц.</li>
          <li>
            <span class="text-style__list-number">3.3</span>Сайт https://skorohot.ru вправе передать персональную информацию пользователя третьим лицам в следующих случаях:
            <ul>
              <li>Пользователь выразил свое согласие на такие действия, путем согласия, выразившегося в предоставлении таких данных;</li>
              <li>Передача необходима в рамках использования пользователем определенного сайта http://skorohot.ru, либо для предоставления товаров и/или оказания услуги пользователю;</li>
              <li>Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры;</li>
              <li>В целях обеспечения возможности защиты прав и законных интересов сайта https://skorohot.ru или третьих лиц в случаях, когда пользователь нарушает Пользовательское соглашение сайта http://skorohot.ru.</li>
            </ul>
          </li>
          <li><span class="text-style__list-number">3.4</span>При обработке персональных данных пользователей сайт https://skorohot.ru руководствуется Федеральным законом РФ «О персональных данных».</li>
          <li class="text-style__list-title">
            <span class="text-style__list-number">4</span>
            <strong>Изменение пользователем персональной информации</strong>
          </li>
          <li>
            <span class="text-style__list-number">4.1</span>
            Пользователь может в любой момент изменить (обновить, дополнить) предоставленную им персональную информацию или её часть, а также параметры её конфиденциальности, оставив заявление в адрес администрации сайта следующими способами:
            <ul>
              <li>Телефон: 8 (918) 057-67-67</li>
              <li>Email: info@skorohot.ru</li>
            </ul>
          </li>
          <li>
            <span class="text-style__list-number">4.2</span>
            Пользователь может в любой момент, отозвать свое согласие на обработку персональных данных, оставив заявление в адрес администрации сайта следующими способами:
            <ul>
              <li>Телефон: 8 (918) 057-67-67</li>
              <li>Email: info@skorohot.ru</li>
            </ul>
          </li>
          <li class="text-style__list-title">
            <span class="text-style__list-number">5</span>
            <strong>Меры, применяемые для защиты персональной информации пользователей</strong>
          </li>
          <li><span class="text-style__list-number">5.1</span>Сайт принимает необходимые и достаточные организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</li>
          <li class="text-style__list-title">
            <span class="text-style__list-number">6</span>
            <strong>Изменение Политики конфиденциальности. Применимое законодательство</strong>
          </li>
          <li><span class="text-style__list-number">6.1</span>Сайт имеет право вносить изменения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики. Действующая редакция всегда находится на странице по адресу https://skorohot.ru/privacy-policy.</li>
          <li><span class="text-style__list-number">6.2</span>К настоящей Политике и отношениям между пользователем и Сайтом, возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.</li>
          <li><span class="text-style__list-number">7</span><strong>Обратная связь. Вопросы и предложения</strong></li>
          <li class="text-style__list-title">
            <span class="text-style__list-number">7.1</span>
            Если у Вас есть какие-либо вопросы или комментарии к Политике конфиденциальности, методам обеспечения конфиденциальности "SkoroHot", или, если Вы хотите, чтобы мы обновили или удалили предоставленную Вами информацию или предпочтения, свяжитесь с нами следующими способами:
            <ul>
              <li>Телефон: 8 (918) 057-67-67</li>
              <li>Email: info@skorohot.ru</li>
            </ul>
          </li>
        </ul>
        <p>Текущая версия Политики конфиденциальности действует с 24 октября 2023 года.</p>
      </div>
    </div>
  </main>
</template>

<style lang="scss">
.text-style {
  margin: 2rem 0 0 0;
  > ul {
    list-style: none;
    li {
      padding: 2px 0;
    }
  }
  p {
    text-indent: 3ch;
  }
  &__list-number {
    font-weight: bold;
    padding: 0 .6rem 0 0;
  }
  &__list-title {
    margin: 1rem 0 0 0;
  }
}
</style>
